Revit 2027 API
IFCCategoryTemplate Constructor
 Custom constructor for this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCCategoryTemplate(
	Document document
)
Public Sub New (
	document As Document
)
public:
IFCCategoryTemplate(
	Document^ document
)
new :
        document : Document -> IFCCategoryTemplate
Parameters
document Document
 Document where created template is saved.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace